In [4]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [66]:
dataset = pd.read_csv(r"titanic.csv") # load dataset -> r- raw string
dataset.head(3) # to show data of 3 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# dataset.fillna(10)  -> wrong way, may be different datatypes present in different columns

In [13]:
# dataset.fillna(method="bfill") - backward filling - same column
# dataset.fillna(method="ffill") - forward filling - same column

In [16]:
# dataset.fillna(method="bfill", axis=1) - backward filling - axis=1 means different column
# dataset.fillna(method="ffill", axis=0) - forward filling - axis=0 means different rows

In [25]:
# dataset["Cabin"].mode() - column datatypes
# dataset["Cabin"].mode()[0]

In [38]:
dataset["Cabin"] = dataset["Cabin"].fillna(dataset["Cabin"].mode()[0])

In [42]:
# dataset.info()

In [53]:
# dataset.select_dtypes(include="object")  - get all object datatypes
# dataset.select_dtypes(include="object").isnull()
# dataset.select_dtypes(include="object").isnull().sum()
dataset.select_dtypes(include="object").columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [51]:
for i in dataset.select_dtypes(include="object").columns:
    dataset[i].fillna(dataset[i].mode()[0])

In [52]:
dataset.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B96 B98,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,B96 B98,S

In [55]:
# dataset.info()

In [80]:
# dataset.select_dtypes(include=["int64", "float64"]).columns
# dataset.select_dtypes(include="int64")

In [92]:
# Fill object columns with mode
for i in dataset.select_dtypes(include="object").columns:
    dataset[i] = dataset[i].fillna(dataset[i].mode()[0])

# Fill numeric columns with mean
for i in dataset.select_dtypes(include=["int64", "float64"]).columns:
    dataset[i] = dataset[i].fillna(dataset[i].mean())

In [88]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [91]:
# dataset.isnull().sum()